nc: 8  # Number of classes (Cityscapes)
depth_multiple: 0.33
width_multiple: 0.25

# YOLOv8.0n backbone with fog-pass filters as side branches
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [0, 1, FogPassFilter, [120, 256, 128, 128]]  # 1: Fog-pass filter (side branch, after layer 0)
  - [-1, 1, Conv, [128, 3, 2]]  # 2-P2/4
  - [2, 1, FogPassFilter, [496, 256, 128, 128]]  # 3: Fog-pass filter (side branch, after layer 2) (Should place after 4th layer if computational expensive)
  - [-1, 3, C2f, [128, True]]  # 4
  - [-1, 1, Conv, [256, 3, 2]]  # 5-P3/8
  - [-1, 6, C2f, [256, True]]  # 6
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P4/16
  - [-1, 6, C2f, [512, True]]  # 8
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
  - [-1, 3, C2f, [1024, True]]  # 10
  - [-1, 1, SPPF, [1024, 5]]  # 11

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12
  - [[-1, 8], 1, Concat, [1]]  # 13: cat backbone P4 (layer 8)
  - [-1, 3, C2f, [512, False]]  # 14
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 6], 1, Concat, [1]]  # 16: cat backbone P3 (layer 6)
  - [-1, 3, C2f, [256, False]]  # 17 (P3/8-small)
  - [-1, 1, Conv, [256, 3, 2]]  # 18
  - [[-1, 14], 1, Concat, [1]]  # 19: cat head P4 (layer 14)
  - [-1, 3, C2f, [512, False]]  # 20 (P4/16-medium)
  - [-1, 1, Conv, [512, 3, 2]]  # 21
  - [[-1, 11], 1, Concat, [1]]  # 22: cat backbone P5 (layer 11, SPPF)
  - [-1, 3, C2f, [1024, False]]  # 23 (P5/32-large)
  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)